from enum import Enum  # برای تعریف نوع شمارشی (enum) استفاده می‌شود


# ======================================================================================================================
class Colour(Enum):
    """
    کلاس Colour رنگ مهره‌ها را مشخص می‌کند.
    اینجا دو رنگ استاندارد بک‌گمون داریم: سفید و سیاه.
    """

    WHITE = 0  # رنگ سفید
    BLACK = 1  # رنگ سیاه

    # ---------------------------------------------------------------------------------
    def other(self):
        """
        رنگ مخالف را برمی‌گرداند.
        اگر سفید باشیم → سیاه
        اگر سیاه باشیم → سفید
        """
        return Colour.BLACK if self == Colour.WHITE else Colour.WHITE

    # ---------------------------------------------------------------------------------
    def __str__(self):
        """
        نمایش رشته‌ای رنگ‌ها برای استفاده در خروجی JSON یا چاپ.
        """
        return "white" if self == Colour.WHITE else "black"

    # ---------------------------------------------------------------------------------
    @staticmethod
    def load(colour_str):
        """
        تبدیل رشته‌ی متنی ('white' یا 'black') به مقدار enum متناظر.
        اگر رشته نامعتبر باشد خطا می‌دهد.
        """
        if colour_str == "black":
            return Colour.BLACK
        elif colour_str == "white":
            return Colour.WHITE
        else:
            raise Exception(f"{colour_str} رنگ معتبر نیست")


# ======================================================================================================================
