from logic.colour import Colour  # وارد کردن کلاس Colour برای رنگ مهره‌ها


# ======================================================================================================================
class Piece:
    """کلاس نماینده یک مهره روی تخته بک‌گمون"""

    def __init__(self, colour: Colour, location: int):
        """
        سازنده مهره
        :param colour: رنگ مهره (سفید یا سیاه)
        :param location: موقعیت مهره روی تخته (1 تا 24)
        """
        self.colour = colour  # ذخیره رنگ مهره
        self.location = location  # ذخیره موقعیت مهره روی تخته

    def spaces_to_home(self) -> int:
        """
        محاسبه تعداد خانه‌هایی که مهره باید برای رسیدن به خانه‌ی هدف طی کند
        :return: تعداد خانه‌های باقی‌مانده تا پایان مسیر
        """
        if self.colour == Colour.WHITE:
            return 25 - self.location  # مهره سفید از خانه 1 به 24 حرکت می‌کند
        else:
            return self.location  # مهره سیاه از خانه 24 به 1 حرکت می‌کند


# ======================================================================================================================
